{
  "backend/main.mo": "Main backend actor defining store settings, user profiles, products, shopping cart, orders, reviews, reward points, and wishlist with access control and storage mixins. Includes admin functions for managing store configuration, payment methods, shipping, taxes, roles, logo, and theme colors.",
  "feature_evidence.json": "Feature evidence report documenting implemented admin settings features including store info, payment methods, shipping rates, tax settings, admin roles, logo upload, and theme customization with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing React components, pages, hooks, and utilities for the e-commerce application including admin settings, product catalog, checkout, and user profile functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, border, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with title 'NOIR PENGUIN FASHION' and root div mounting the app from main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, category, product detail, checkout, payment success/failure, account, order detail, and admin settings pages wrapped in ThemeProvider and Layout.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying penguin logo, brand headline, and four brand values in a grid with sparkle icons and soft pink accent styling.",
  "frontend/src/components/AdminRolesSection.tsx": "Admin roles management component with table displaying admin users and role selection dropdowns, restricted to super admins with save functionality using useUpdateAdminRoles mutation.",
  "frontend/src/components/CategoryCard.tsx": "Category card component with image, emoji, and name that navigates to category page on click with hover effects including pink border glow and scale animation.",
  "frontend/src/components/CountdownTimer.tsx": "A React component that displays a countdown timer to a target date, showing days, hours, minutes, and seconds in styled boxes with automatic updates every second.",
  "frontend/src/components/FeaturedCollection.tsx": "Displays a featured collection (specifically 'Midnight Drop') with a countdown timer and grid of featured product cards, fetching data from the backend API.",
  "frontend/src/components/FeaturedProductCard.tsx": "A product card component with image, price, wishlist toggle, and add-to-cart functionality, requiring authentication for cart/wishlist actions and showing stock warnings.",
  "frontend/src/components/FloatingPenguinMascot.tsx": "A dismissible floating penguin mascot image positioned at the bottom-right corner with animation and a close button that appears on hover.",
  "frontend/src/components/HeroSection.tsx": "The main hero section with background image, gradient overlays, headline text, and two call-to-action buttons navigating to different product categories.",
  "frontend/src/components/ImageSlider.tsx": "An image carousel component with navigation arrows and thumbnail previews, displaying product images with fallback to a penguin emoji if no images exist.",
  "frontend/src/components/Layout.tsx": "The main layout wrapper with sticky header containing logo, navigation menu, cart/wishlist icons, login button, profile setup modal, and mobile cart icon.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators and query cache clearing.",
  "frontend/src/components/LogoUploadSection.tsx": "An admin component for uploading and previewing store logos with file validation (PNG/JPG/SVG, max 2MB) and conversion to ExternalBlob format.",
  "frontend/src/components/LookbookImage.tsx": "A lookbook image component with scroll-triggered animations and interactive hotspots that appear on hover, linking to associated products.",
  "frontend/src/components/LookbookSection.tsx": "Displays a lookbook section with three hardcoded images and associated products fetched from the first lookbook entry. Returns null if no lookbooks are available.",
  "frontend/src/components/MobileCartIcon.tsx": "Renders a fixed floating cart icon for mobile devices that shows the total item count and links to checkout. Only visible when user is authenticated.",
  "frontend/src/components/OrdersList.tsx": "Shows a list of user orders with summary information (ID, date, item count, total) that are clickable to navigate to order details. Displays empty state if no orders exist.",
  "frontend/src/components/OrderStatusBadge.tsx": "Displays a styled badge component that maps OrderStatus enum values to human-readable labels with appropriate color variants.",
  "frontend/src/components/PaymentMethodsSection.tsx": "Admin settings card for configuring Stripe payment gateway, including API key input with visibility toggle and checkboxes for accepted card types. Saves configuration via mutation hook.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to create their profile with name (required), email, and address fields. Submits data via useSaveCallerUserProfile mutation.",
  "frontend/src/components/RecommendedProducts.tsx": "Displays up to 4 recommended products from the same designer as the current product, excluding the current product itself. Returns null if no recommendations found.",
  "frontend/src/components/ReviewsList.tsx": "Shows product reviews with star ratings and comments, plus a form for authenticated users to submit new reviews with rating and comment fields.",
  "frontend/src/components/ShippingRatesSection.tsx": "Admin settings card for configuring flat rate shipping, free shipping threshold, and region-specific shipping costs with add/remove functionality. Saves via mutation hook.",
  "frontend/src/components/ShopByCategory.tsx": "Displays a grid of four hardcoded product categories (Noir Dresses, Hoodies, Pink Sets, Accessories) with images and emojis using CategoryCard components.",
  "frontend/src/components/StoreInfoSection.tsx": "React component that renders a form card for editing store information (name, contact email, phone, address) with save functionality using the useUpdateStoreInfo mutation hook.",
  "frontend/src/components/TaxSettingsSection.tsx": "React component that provides a form to configure sales tax percentage and manage tax-exempt regions with add/remove functionality, using the useUpdateTaxSettings mutation hook.",
  "frontend/src/components/ThemeColorsSection.tsx": "React component for customizing brand theme colors (primary and secondary palette) with color pickers, preview display, and reset-to-defaults functionality using the useUpdateThemeColors mutation hook.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations covering products, collections, cart, wishlist, orders, reviews, lookbooks, user profiles, store settings, and admin operations.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook that uses IntersectionObserver to detect when an element becomes visible in the viewport, returning a ref and visibility state for scroll-based animations.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display and Inter), configures Tailwind CSS layers, defines CSS custom properties for a Noir Penguin brand theme with light/dark modes using OKLCH color space, and includes custom utility classes for brand colors, animations (float, sparkle), and glow effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching, InternetIdentityProvider for authentication, and renders the main App component.",
  "frontend/src/pages/AccountPage.tsx": "Displays authenticated user's account page showing reward points (balance, birthday/student discounts), wishlist with product cards, and order history; redirects unauthenticated users to login.",
  "frontend/src/pages/AdminSettingsPage.tsx": "Admin-only settings page with tabbed interface for managing store configuration including store info, payment methods, shipping rates, tax settings, admin roles, logo upload, and theme colors; checks authentication and admin privileges before rendering.",
  "frontend/src/pages/CategoryPage.tsx": "Displays products filtered by category using URL parameter, maps category slugs to display names (Noir Dresses, Cozy Hoodies, Pink Sets, Accessories), and renders products in a responsive grid.",
  "frontend/src/pages/CheckoutPage.tsx": "Shopping cart page that displays cart items with product details and removal functionality, calculates total, and initiates Stripe checkout session; requires authentication and handles empty cart states.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes multiple sections: HeroSection, ShopByCategory, FeaturedCollection, LookbookSection, and AboutSection.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays detailed view of a single order including order ID, creation date, status badge, list of items with product images and quantities, and total amount; includes back navigation to account page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying error icon and message with action buttons to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that clears the cart on mount and displays success message with navigation options to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page component that displays product information, image slider, reviews, quantity selector, and add-to-cart functionality with authentication checks and toast notifications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand colors (noirBlack, softPink, silver, lavender, icyBlue), animations (float, sparkle, accordion), fonts (Playfair Display, Inter), and glow/neon shadow effects.",
  "project_state.json": "Project state document describing NOIR PENGUIN FASHION eCommerce site architecture, design system (black + pastel fusion), tech stack (React/Next.js/Tailwind/Stripe), and implemented features including hero section, shop categories, product pages, and lookbook."
}